<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// [ 应用入口文件 ]

//   定义应用目录
define('APP_PATH', __DIR__ . '/../application/');
//   修改日志文件存储路径（因为一般log文件不要放在项目里面）
define('LOG_PATH', __DIR__ . '/../log/');
//define('EXTEND_PATH','./extend/');
// 加载框架引导文件
require __DIR__ . '/../thinkphp/start.php';

//数据库生成日志必须要初始化一下，这样的动作最好在这种起点文件中实现比较方便
//但是生成数据库日志最好在调试阶段，以后就不要了
\think\log::init([
    'type' => 'File',
    'path' => LOG_PATH,
    'level' => ['sql']
]);
